package org.cas.client.platform.pimview.util;

public interface ViewConstants {
    /**
     * 本对象包装了所有邮件字段的缺省宽度 我个人认为用int型比较节约空间，不知对不对
     */
    public static final int[] EMAIL_FIELD_WIDTHS = {
            // 0--5
            // ID, "主题", READED, ICON, SIZE, ATTACH, ATTACHMENT,
            20, 350, 20, 19, 145, 0, 13,
            // 6-10
            // IMPORTANCE, FLAGSTATUS, ADDRESSER, RECIEVEDAT "邮件正文",
            13, 140, 140, 150, 200,
            // 11-15
            // "类别", "后续标志", "后续标记完成",
            100, 140, 20,
            // 16-20
            // "到期时间", "联系人字段", "抄送", "创建时间", "到期",
            140, 160, 19, 140, 140,
            // 21--25
            // "发送时间", "跟踪状态", "会话", "记帐信息", "将答复发送给",
            140, 40, 140, 140, 140,
            // 26-30
            // "里程", "暗送", "敏感度", "收件人", "推迟到",
            100, 140, 70, 140, 140,
            // 31--35
            // "下载状态", "修改人", "修改时间", "需要回执", "Internet帐号",
            70, 140, 140, 70, 160,
            // 36-38
            // "描述", "邮件正文类型", "部署"
            160, 200, 80 };

    // 任务的字段列表
    public static final int[] TASK_FLDS_WIDTHS = {
            // 0- 8
            // "ID", "主题", READED, ICON, SIZE, ATTACH, ATTACHMENT,
            10, 200, 10, 19, 145, 0, 13,
            // 6-10
            // IMPORTANCE, FLAGSTATUS, ADDRESSER, RECIEVEDATE, "附注",
            13, 140, 140, 150, 100,
            // 11-15
            // "类别", "后续标志", "后续标记完成",
            100, 140, 20,
            // 16-20
            // "到期时间", "联系人", "完成", "截止时间", "单位",
            140, 160, 18, 160, 160,
            // 21-25
            // "工作总量", "开始时间", "实际工作", "所有者", "完成率",
            100, 160, 200, 100, 20,
            // 26-30
            // "完成日期", "修改时间", "状态", "创建时间", "分配",
            160, 160, 19, 160, 100,
            // 31-35
            // "记帐信息", "里程", "收件人", "提醒", "提醒时间",
            160, 100, 160, 80, 160,
            // 36
            // "是否需要提醒"
            13 };
    // 日记字段的列表
    public static final int[] DIARY_FLDS_WIDTHS = {
            // 0-5
            // "ID", "主题", 已读, ICON, SIZE, ATTACH, ATTACHMENT,
            10, 150, 19, 19, 145, 0, 13,
            // 6-10
            // IMPORTANCE, FLAGSTATUS, ADDRESSER, RECIEVEDATE, COMMENT
            13, 140, 140, 150, 100,
            // 11-15
            // "类别", "后续标志", "后续标记完成",
            100, 140, 20,
            // 16-20
            // "到期时间", "联系人", "创建时间", "修改时间" "天气"
            140, 160, 160, 160, 19,
            // 21
            // "心情"
            19 };

    // 日历的字段列表
    public static final int[] CALENDAR_FLDS_WIDTHS = {
            // 0- 8
            // "ID", "主题", READED, ICON, SIZE, ATTACH ATTACHMENT,
            10, 200, 10, 19, 145, 0, 13,
            // 6-10
            // IMPORTANCE, FLAGSTATUS, ADDRESSER, RECIEVEDATE, "附注",
            13, 140, 140, 150, 100,
            // 11-15
            // "类别", "后续标志", "后续标记完成",
            100, 140, 20,
            // 16-20
            // "到期时间", "联系人", "收件人", "地点", "开始时间",
            140, 160, 180, 160, 160,
            // 21-25
            // "结束时间", "邀请", "全天事件", "提醒", "提醒时间",
            100, 160, 160, 80, 160,
            // 26-28
            // "提醒声音", "时间显示", "定期模式",
            100, 160, 80 };
    //
    public static final int[] CONTACTS_FIELD_WIDTHS = {
            // 0--5
            // "ID", "显示为!", "已读", "图标!", SIZE, ATTACH, ATTACHMENT,
            10, 160, 19, 19, 145, 0, 13,
            // 6--10
            // IMPORTANCE, FLAGSTATUS, ADDRESSER, RECIEVEDATE, "注释",
            13, 140, 140, 150, 200,
            // 11-15
            // "类别!", "后续标志!", "后续标记完成",
            70, 80, 20,
            // 16--20
            // "提醒时间", "联系人字段", "称谓", "中文称谓", "名字!",
            140, 100, 80, 80, 80,
            // 21-25
            // "中间名", "姓氏!", "昵称", "经理姓名", "职务!",
            80, 80, 80, 80, 140,
            // 26--30
            // "助理的姓名", 电子邮件!",           "电子邮件 2!",             "电子邮件 3!",         "办公室",
            80, 160, 160, 160, 90,
            // 31-35
            // "部门!", "家庭地址", "家庭地址 - 城市", "家庭地址 - 国家"!, "家庭地址 - 街道",
            90, 190, 190, 190, 190,
            // 36--40
            // "家庭地址 - 省/自治区!", "家庭地址 - 邮编", "商务地址", "商务地址 - 城市", "商务地址 - 国家",
            190, 80, 190, 70, 70,
            // 41-45
            // "商务地址 - 街道", "商务地址 - 省/自治区","商务地址 - 邮编", "其他地址", "其他地址 - 城市",
            190, 70, 70, 190, 190,
            // 46--50
            // "其他地址 - 国家", "其他地址 - 街道", "其他地址 - 省/自治区", "其他地址 - 邮编", "通讯地址!",
            90, 190, 70, 70, 160,
            // 51-55
            // "Web 页", "纪念日", "配偶", "生日", "性别",
            190, 90, 80, 90, 20,
            // 56--60
            // "职业", "TTY/TDD 电话", "车载电话!", "单位主要电话!", "回电话",
            90, 160, 160, 90, 90,
            // 61-65
            // "家庭电话!70", "家庭电话 2", "其他电话!", "商务电话!", "商务电话 2",
            70, 70, 90, 90, 90,
            // 66--70
            // "无线电话", "寻呼机" "移动电话!", "主要电话", "助理的电话",
            70, 160, 70, 70, 70,
            // 71-75
            // " ISDN", "电报", "家庭传真", "商务传真!", "其他传真",
            70, 160, 70, 70, 160,
            // 76--80这样要作转换的地方可以减少一点
            // "ICQ", "OICQ", "IP地址", "照片", "提醒主题",
            100, 100, 150, 100, 150,
            // 81-84
            // "单位!", "  通讯组成员列表!", "类型!", "纯文本发送"
            160, 160, 70, 10 };
}
