package org.cas.client.resource.international;

/***/
public interface IntlModelConstants
{
    String ID = "ID";    //0,唯一标识号
    String CAPTION = "主题";    //1,显示标题(可能是表示为/主题等)
    String READED = "是否已读";   //2,该字段永远不会被显示,在此放在数组里只起一个占位作用.
    String ICON = "图标";   //3,
    String SIZE = "大小";   //4,
    String ATTACH = "附件路径"; //5 该字段永远不会被显示,在此放在数组里只起一个占位作用.
    String ATTACHMENT = "附件"; //6,
    String IMPORTANCE = "重要性";    //7,
    String FLAGSTATUS = "标记状态";   //8,
    String ADDRESSER = "发件人"; //9, 发件人
    String RECIEVEDATE = "接收时间";    //10,接收时间
    
    String CATEGORY = "类别";   //12
    String FOLLOWUPFLAG = "后续标记"; //13
    String FOLDERID = "所在文件夹";//14
    String DELETED = "是否已删除";   //15
    String FOLLOWUPCOMPLETE = "后续动作已完成";//16;后续标记是否已经完成？
    String FOLOWUPENDTIME = "后续动作到期时间";//17;后续标记到期时间
    String CONTACT = "联系人";//18;联系人
    
    int COMMON_FIELD_COUNT = 19; //@NOTE: 公用字段的个数，各位大侠请注意维护这个变量
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //联系人
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /**
     *  对于联系人来说，“类型”的取值为0或1，其中0表示联系人，1表示通讯组
     *  当类型为0时，"通讯组成员列表"字段的值为空；
     *  当类型为1时，除了ID、显示为、注释、所在文件夹、通讯组成员列表、类型、类别字段外其他所有字段均为空。
     */
    String[] CONTACTS_FIELD =
    {
        //0--5
        ID,					"显示为",               	READED,				ICON,				SIZE,			ATTACH,     
        //6-10
		ATTACHMENT,			IMPORTANCE,             FLAGSTATUS,			ADDRESSER,			RECIEVEDATE,           
        //11-15
		"注释",				CATEGORY,               FOLLOWUPFLAG,		FOLDERID,			DELETED,
        //16-20
		 FOLLOWUPCOMPLETE,	FOLOWUPENDTIME,			CONTACT,			"称谓",				"中文称谓",                 
        //21--25
		 "名字",				"中间名",					"姓氏",				"昵称",				"经理姓名",                 
        //26-30
		 "职务",				"助理的姓名",				"电子邮件",			"电子邮件 2",			"电子邮件 3",               
        //31--35
        "办公室",				"部门",                  "家庭地址",			"家庭地址 - 城市",		"家庭地址 - 国家",        
        //36-40
        "家庭地址 - 街道",		"家庭地址 - 省/自治区",		"家庭地址 - 邮编",		"商务地址",			"商务地址 - 城市",       
        //41--45
        "商务地址 - 国家",		"商务地址 - 街道",        "商务地址 - 省/自治区", "商务地址 - 邮编",	"其他地址",             
        //46-50
        "其他地址 - 城市",		"其他地址 - 国家",        "其他地址 - 街道",    "其他地址 - 省/自治区",	"其他地址 - 邮编",     
        //51--55
        "通讯地址",     		"Web 页",           		"纪念日",             "配偶",                    "生日",                   
        //56-60
        "性别",              "职业",                  "TTY/TDD 电话",       "车载电话",              "单位主要电话",           
        //61--65
        "回电话",				"家庭电话",				"家庭电话 2",         "其他电话",                "商务电话",             
        //66-70
        "商务电话 2",			"无线电话",         		"寻呼机",             "移动电话",               "主要电话",             
        //71--75
        "助理的电话",			"ISDN",                	"电报",               "家庭传真",                "商务传真",            
        //76--80
        "其他传真",			"ICQ",                 "OICQ",                "IP地址",                  "照片",               
        //81--83
        "提醒主题",			"单位",					"通讯组成员列表",         "类型",                 "纯文本发送"
    };
    
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //系统联系人
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /**
     *  对于联系人来说，“类型”的取值为0或1，其中0表示联系人，1表示通讯组
     *  当类型为0时，"通讯组成员列表"字段的值为空；
     *  当类型为1时，除了ID、显示为、注释、所在文件夹、通讯组成员列表、类型、类别字段外其他所有字段均为空。
     */
    String[] SYS_CONTACTS_FIELD =
    {
        //0--5
        ID,					"显示为",			READED,			ICON,				SIZE,			ATTACH,     
        //6-10
		ATTACHMENT,			IMPORTANCE,		FLAGSTATUS,		ADDRESSER,			RECIEVEDATE,           
        //11-15
		"注释",				CATEGORY,		FOLLOWUPFLAG,	FOLDERID,			DELETED,
        //16-20
		FOLLOWUPCOMPLETE,	FOLOWUPENDTIME,	CONTACT,		"中文姓名",			"英文姓名",			
        //21--25
		"姓名拼音",			"城市",			"性别",			"出生日期",			"地址1",				
        //26-30
        "地址2",				"邮编",			"通讯地址",		"住宅电话",			"移动电话",			
        //31--35
        "身份证",				"籍贯",			"民族",			"党派",				"FALSE",			
        //36-40
        "办公电话",			"电子邮件",		"员工类别",		"FALSE",			"职等",				
        //41--45
        "社会工作日",			"雇佣有效日",		"下次评估日期",	"地区",				"中心城市",			
        //46-50
        "城市编码",			"职能单元",		"部门",			"组织结构起始日期",	"相片",				 
        //51--55
        "试用期结束日",		"省份",          "户口"
    };
    
    
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //邮件
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    String[] EMAIL_FLDS =
    {
        //0--5
        ID,					CAPTION,			READED,				ICON,			SIZE,			ATTACH, 
        //6-10
        ATTACHMENT,			IMPORTANCE,			FLAGSTATUS,			ADDRESSER,		RECIEVEDATE,
        //11--15
        "邮件正文",			CATEGORY,			FOLLOWUPFLAG,		FOLDERID,		DELETED,
        //16-20
        FOLLOWUPCOMPLETE,	FOLOWUPENDTIME, 	CONTACT,			"抄送",			"创建时间",		
        //21--25
        "到期",				"发送时间",			"跟踪状态",			"会话",			"记帐信息",             
        //26-30
        "将答复发送给",		"里程",				"暗送",				"敏感度",			"收件人",              
        //31--35
        "推迟到",				"下载状态",			"修改人",				"修改时间",		"需要回执",
        //36
        "Internet帐号"
    };
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //任务
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    String[] TASK_FLDS = new String[]
    {
        //0--5
        ID,					CAPTION,			READED,				ICON,				SIZE,			ATTACH,    
        //6-10
        ATTACHMENT,			IMPORTANCE,			FLAGSTATUS,			ADDRESSER,			RECIEVEDATE,          
        //11-15
        "附注",				CATEGORY,			FOLLOWUPFLAG,		FOLDERID,			DELETED,               
        //16-20
        FOLLOWUPCOMPLETE,	FOLOWUPENDTIME,		CONTACT,			"完成",				"截止时间",             
        //21--35
        "单位",				"工作总量",			"开始时间",			"实际工作",			"所有者",              
        //26-30
        "完成率",				"完成日期",			"修改时间",			"状态",				"创建时间",             
        //31-35
        "分配",				"记帐信息",			"里程",				"收件人",				"提醒",               
        //36
        "提醒时间"
    };
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //日记
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    String[] DIARY_FLDS = new String[]
    {
        //0--5
        ID,					CAPTION,			READED,				ICON,				SIZE,			ATTACH, 
        //6-10
        ATTACHMENT,			IMPORTANCE,			FLAGSTATUS,			ADDRESSER,			RECIEVEDATE,            
        //11-15
        "备注",				CATEGORY,			FOLLOWUPFLAG,		FOLDERID,			DELETED,
        //16-20
        FOLLOWUPCOMPLETE,	FOLOWUPENDTIME,		CONTACT,			"创建时间",			"修改时间",              
        //21
        "天气",				"心情"
    };
    

    //***日历表的字段*******/
    String[] APPOINTMENT_FLDS = new String[]
    {
        //0--5
        ID,             	CAPTION,			READED,         	ICON,           SIZE,           ATTACH,  
        //6-10
        ATTACHMENT,			IMPORTANCE,			FLAGSTATUS,			ADDRESSER,      RECIEVEDATE,  
        //11-15
        "备注",				CATEGORY,			FOLLOWUPFLAG,       FOLDERID,		DELETED,       
        //16-20
        FOLLOWUPCOMPLETE,	FOLOWUPENDTIME,		CONTACT,            "收件人",			"地点",           
        //21-25
        "开始时间",			"结束时间",			"邀请",				"全天事件",		"提醒",           
        //26-28
        "提醒时间",     		"提醒声音",			"时间显示",			"定期模式"
    };    
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //类别
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    String[] DEFAULT_CATEGORY = new String[]{
        "VIP", "桑拿", "足浴", "计件", "月薪", "110分钟", "90分钟", "80分钟", "70分钟","50分钟","45分钟","30分钟"
    };
    //
    String JUNK_MAIL_RULE_NAME = "垃圾邮件规则";
    //
    String ADULT_MAIL_RULE_NAME = "成人邮件规则";
}


////本地文件夹
//String[] LOCALFOLDER_FLDS = new String[]
//{
//		//0--5
//      ID,                     CAPTION,                 READED,                 ICON,                  SIZE,                 ATTACH,   ATTACHMENT,
//      //6-10
//      IMPORTANCE,             FLAGSTATUS,             ADDRESSER,              RECIEVEDATE,           "邮件正文",
//      //11--15
//      CATEGORY,               FOLLOWUPFLAG,                          FOLLOWUPCOMPLETE,        
//      //16-20
//      FOLOWUPENDTIME,         CONTACT, 	"文件夹",		"未读",	"总计",
//      //
//      "同步设置", ""
//};
